Revit 2024 API
ElementIdParameterValue Class
 A class that holds a ElementId value of a parameter element.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
Since: 2016 Subscription Update
Syntax
C#
public class ElementIdParameterValue : ParameterValue
Visual Basic
Public Class ElementIdParameterValue _
	Inherits ParameterValue
Visual C++
public ref class ElementIdParameterValue : public ParameterValue
Inheritance Hierarchy
System.Object
 Autodesk.Revit.DB.ParameterValue
 Autodesk.Revit.DB.ElementIdParameterValue
See Also
ElementIdParameterValue Members
Autodesk.Revit.DB Namespace